
### Terragrunt diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_network_interface_security_group_association.assoc-nif-sg-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox]
azurerm_network_security_rule.ngs-jumpbox-allow-80: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInbound80]
azurerm_network_security_rule.nsg-jumpbox-allow-ssh: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInboundSSH]
azurerm_public_ip.ip-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-jumpbox]
azurerm_network_interface.nif-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox]
azurerm_network_security_rule.ngs-jumpbox-allow-443: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInbound443]
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]
azurerm_network_security_group.nsg-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox]
azurerm_private_dns_zone.phz: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/privateDnsZones/servrfarm.tech]
azurerm_virtual_network.vnet-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev]
azurerm_public_ip.ip-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_ssh_public_key.ssh-pub-key: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/sshPublicKeys/global-ssh-key]
azurerm_nat_gateway.ng-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev]
azurerm_subnet.subnet-pub-dev-01: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_nat_gateway_public_ip_association.ng-dev-associate-public-ip: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_subnet_nat_gateway_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_subnet_network_security_group_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_managed_disk.dev-box-storage will be created
  + resource "azurerm_managed_disk" "dev-box-storage" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 32
      + id                                = (known after apply)
      + location                          = "centralindia"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "dev-box-storage"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "dev-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Standard_LRS"
      + tier                              = (known after apply)
    }

  # azurerm_network_interface.nif-dev-box will be created
  + resource "azurerm_network_interface" "nif-dev-box" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "centralindia"
      + mac_address                    = (known after apply)
      + name                           = "nif-dev-box"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "dev-rg"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "nif-dev-box-public-ip-cfg"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01"
        }
    }

  # azurerm_network_interface.nif-jumpbox will be destroyed
  # (because azurerm_network_interface.nif-jumpbox is not in configuration)
  - resource "azurerm_network_interface" "nif-jumpbox" {
      - accelerated_networking_enabled = false -> null
      - applied_dns_servers            = [] -> null
      - dns_servers                    = [] -> null
      - enable_accelerated_networking  = false -> null
      - enable_ip_forwarding           = false -> null
      - id                             = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox" -> null
      - ip_forwarding_enabled          = false -> null
      - location                       = "centralindia" -> null
      - mac_address                    = "00-0D-3A-3E-2F-32" -> null
      - name                           = "nif-jumpbox" -> null
      - private_ip_address             = "192.168.18.4" -> null
      - private_ip_addresses           = [
          - "192.168.18.4",
        ] -> null
      - resource_group_name            = "dev-rg" -> null
      - tags                           = {} -> null
        # (6 unchanged attributes hidden)

      - ip_configuration {
          - name                                               = "nif-jumpbox-public-ip-cfg" -> null
          - primary                                            = true -> null
          - private_ip_address                                 = "192.168.18.4" -> null
          - private_ip_address_allocation                      = "Dynamic" -> null
          - private_ip_address_version                         = "IPv4" -> null
          - public_ip_address_id                               = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-jumpbox" -> null
          - subnet_id                                          = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_network_interface_security_group_association.assoc-nif-sg-dev-box will be created
  + resource "azurerm_network_interface_security_group_association" "assoc-nif-sg-dev-box" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_interface_security_group_association.assoc-nif-sg-jumpbox will be destroyed
  # (because azurerm_network_interface_security_group_association.assoc-nif-sg-jumpbox is not in configuration)
  - resource "azurerm_network_interface_security_group_association" "assoc-nif-sg-jumpbox" {
      - id                        = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox" -> null
      - network_interface_id      = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox" -> null
      - network_security_group_id = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox" -> null
    }

  # azurerm_network_security_group.nsg-dev-box will be created
  + resource "azurerm_network_security_group" "nsg-dev-box" {
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "nsg-dev-box"
      + resource_group_name = "dev-rg"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_group.nsg-jumpbox will be destroyed
  # (because azurerm_network_security_group.nsg-jumpbox is not in configuration)
  - resource "azurerm_network_security_group" "nsg-jumpbox" {
      - id                  = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox" -> null
      - location            = "centralindia" -> null
      - name                = "nsg-jumpbox" -> null
      - resource_group_name = "dev-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyInboundSSH"
              - priority                                   = 999
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyInbound443"
              - priority                                   = 1000
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyInbound80"
              - priority                                   = 1001
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - tags                = {} -> null
    }

  # azurerm_network_security_rule.ngs-dev-box-allow-443 will be created
  + resource "azurerm_network_security_rule" "ngs-dev-box-allow-443" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowAnyInbound443"
      + network_security_group_name = "nsg-dev-box"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.ngs-dev-box-allow-80 will be created
  + resource "azurerm_network_security_rule" "ngs-dev-box-allow-80" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowAnyInbound80"
      + network_security_group_name = "nsg-dev-box"
      + priority                    = 1001
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.ngs-jumpbox-allow-443 will be destroyed
  # (because azurerm_network_security_rule.ngs-jumpbox-allow-443 is not in configuration)
  - resource "azurerm_network_security_rule" "ngs-jumpbox-allow-443" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "443" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInbound443" -> null
      - name                                       = "AllowAnyInbound443" -> null
      - network_security_group_name                = "nsg-jumpbox" -> null
      - priority                                   = 1000 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "dev-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_network_security_rule.ngs-jumpbox-allow-80 will be destroyed
  # (because azurerm_network_security_rule.ngs-jumpbox-allow-80 is not in configuration)
  - resource "azurerm_network_security_rule" "ngs-jumpbox-allow-80" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "80" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInbound80" -> null
      - name                                       = "AllowAnyInbound80" -> null
      - network_security_group_name                = "nsg-jumpbox" -> null
      - priority                                   = 1001 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "dev-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_network_security_rule.nsg-dev-box-allow-ssh will be created
  + resource "azurerm_network_security_rule" "nsg-dev-box-allow-ssh" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowAnyInboundSSH"
      + network_security_group_name = "nsg-dev-box"
      + priority                    = 999
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.nsg-jumpbox-allow-ssh will be destroyed
  # (because azurerm_network_security_rule.nsg-jumpbox-allow-ssh is not in configuration)
  - resource "azurerm_network_security_rule" "nsg-jumpbox-allow-ssh" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "22" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInboundSSH" -> null
      - name                                       = "AllowAnyInboundSSH" -> null
      - network_security_group_name                = "nsg-jumpbox" -> null
      - priority                                   = 999 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "dev-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_public_ip.ip-dev-box will be created
  + resource "azurerm_public_ip" "ip-dev-box" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralindia"
      + name                    = "ip-address-dev-box"
      + resource_group_name     = "dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.ip-jumpbox will be destroyed
  # (because azurerm_public_ip.ip-jumpbox is not in configuration)
  - resource "azurerm_public_ip" "ip-jumpbox" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-jumpbox" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "4.213.156.249" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "centralindia" -> null
      - name                    = "ip-address-jumpbox" -> null
      - resource_group_name     = "dev-rg" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {} -> null
      - zones                   = [] -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet_network_security_group_association.name must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "name" {
      ~ id                        = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 9 to add, 0 to change, 8 to destroy.

Error: Incorrect attribute value type

  on jumpboxes.tf line 87, in resource "azurerm_linux_virtual_machine" "dev-box":
  87:     public_key = azurerm_ssh_public_key.ssh-pub-key
    ├────────────────
    │ azurerm_ssh_public_key.ssh-pub-key is object with 7 attributes

Inappropriate value for attribute "public_key": string required.

Error: parsing "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev": parsing segment "staticMicrosoftCompute": parsing the VirtualMachine ID: the segment at position 5 didn't match

Expected a VirtualMachine ID that matched:

> /subscriptions/12345678-1234-9876-4563-123456789012/resourceGroups/example-resource-group/providers/Microsoft.Compute/virtualMachines/virtualMachineValue

However this value was provided:

> /subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev

The parsed Resource ID was missing a value for the segment at position 5
(which should be the name of the Resource Provider [for example 'Microsoft.Compute']).



  with azurerm_virtual_machine_data_disk_attachment.attach-dev-box-storage-to-dev-box,
  on jumpboxes.tf line 116, in resource "azurerm_virtual_machine_data_disk_attachment" "attach-dev-box-storage-to-dev-box":
 116:   virtual_machine_id = azurerm_virtual_network.vnet-dev.id

Releasing state lock. This may take a few moments...
time=2024-08-10T11:52:59Z level=error msg=terraform invocation failed in /home/runner/work/azure-terraform-infra/azure-terraform-infra/terraform/global error=[/home/runner/work/azure-terraform-infra/azure-terraform-infra/terraform/global] exit status 1
time=2024-08-10T11:52:59Z level=error msg=1 error occurred:
	* [/home/runner/work/azure-terraform-infra/azure-terraform-infra/terraform/global] exit status 1




```
